In [38]:
import pyodbc
import pandas as pd
import difflib
from fuzzywuzzy import fuzz
from fuzzywuzzy import process

In [39]:
server = 'dataintegrationproject.database.windows.net' 
database = 'DieZweiFragezeichen' 
username = 'di_public' 
password = 'DI_Pub2022!'  
cnxn = pyodbc.connect('DRIVER={SQL Server};SERVER='+server+';DATABASE='+database+';UID='+username+';PWD='+ password)
cursor = cnxn.cursor()

In [50]:
q_HDI = "SELECT * FROM HDI;"
q_AdjustedNI = "SELECT * FROM AdjustedNetIncome;"
q_Countries = "SELECT * FROM Countries;"
q_CountryGdp = "SELECT * FROM CountryGdp;"
q_DurSchoolCompulsory = "SELECT * FROM DurSchoolCompulsory;"
q_LifeExpectancy = "SELECT * FROM LifeExpectancy;"
q_LiteracyRate = "SELECT * FROM LiteracyRate;"

HDI = pd.read_sql(q_HDI, cnxn)
AdjustedNetIncome = pd.read_sql(q_AdjustedNI, cnxn)
Countries = pd.read_sql(q_Countries, cnxn)
CountryGdp = pd.read_sql(q_CountryGdp, cnxn)
DurSchoolCompulsory = pd.read_sql(q_DurSchoolCompulsory, cnxn)
LifeExpectancy = pd.read_sql(q_LifeExpectancy, cnxn)
LiteracyRate = pd.read_sql(q_LiteracyRate, cnxn)

In [33]:
CountryGdp

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021
0,Aruba,ABW,GDP (current US$),NY.GDP.MKTP.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,2.534637e+09,2.727850e+09,2.790849e+09,2.962905e+09,2.983637e+09,3.092430e+09,3.202189e+09,NaN,NaN,None
1,Africa Eastern and Southern,AFE,GDP (current US$),NY.GDP.MKTP.CD,2.008272e+10,2.050945e+10,2.235043e+10,2.675866e+10,2.446499e+10,2.787894e+10,...,9.505214e+11,9.642424e+11,9.848071e+11,9.199300e+11,8.733549e+11,9.853557e+11,1.012853e+12,1.009910e+12,9.207923e+11,None
2,Afghanistan,AFG,GDP (current US$),NY.GDP.MKTP.CD,5.377778e+08,5.488889e+08,5.466667e+08,7.511112e+08,8.000000e+08,1.006667e+09,...,1.990732e+10,2.014640e+10,2.049713e+10,1.913421e+10,1.811656e+10,1.875347e+10,1.805323e+10,1.879945e+10,2.011614e+10,None
3,Africa Western and Central,AFW,GDP (current US$),NY.GDP.MKTP.CD,1.040428e+10,1.112805e+10,1.194335e+10,1.267652e+10,1.383858e+10,1.486247e+10,...,7.275714e+11,8.207876e+11,8.649666e+11,7.607297e+11,6.905430e+11,6.837416e+11,7.416916e+11,7.945725e+11,7.845876e+11,None
4,Angola,AGO,GDP (current US$),NY.GDP.MKTP.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,1.280529e+11,1.367099e+11,1.457122e+11,1.161936e+11,1.011239e+11,1.221238e+11,1.013532e+11,8.941719e+10,5.837598e+10,None
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
261,Kosovo,XKX,GDP (current US$),NY.GDP.MKTP.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,6.163785e+09,6.735731e+09,7.074658e+09,6.295820e+09,6.682833e+09,7.180813e+09,7.878509e+09,7.899879e+09,7.716925e+09,None
262,"Yemen, Rep.",YEM,GDP (current US$),NY.GDP.MKTP.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,3.540134e+10,4.041524e+10,4.322859e+10,4.244510e+10,3.131737e+10,2.684013e+10,2.160614e+10,NaN,NaN,None
263,South Africa,ZAF,GDP (current US$),NY.GDP.MKTP.CD,7.575397e+09,7.972997e+09,8.497997e+09,9.423396e+09,1.037400e+10,1.133440e+10,...,4.344005e+11,4.008860e+11,3.811989e+11,3.467098e+11,3.235855e+11,3.814488e+11,4.048421e+11,3.879346e+11,3.354421e+11,None
264,Zambia,ZMB,GDP (current US$),NY.GDP.MKTP.CD,7.130000e+08,6.962857e+08,6.931429e+08,7.187143e+08,8.394286e+08,1.082857e+09,...,2.550306e+10,2.803724e+10,2.714102e+10,2.125122e+10,2.095841e+10,2.587360e+10,2.631159e+10,2.330867e+10,1.811063e+10,None
265,Zimbabwe,ZWE,GDP (current US$),NY.GDP.MKTP.CD,1.052990e+09,1.096647e+09,1.117602e+09,1.159512e+09,1.217138e+09,1.311436e+09,...,1.711485e+10,1.909102e+10,1.949552e+10,1.996312e+10,2.054868e+10,1.758489e+10,1.811554e+10,1.928429e+10,1.805117e+10,None

In [4]:
HDI['Country1'] = HDI['Country'].apply(lambda x: difflib.get_close_matches(x, Countries['TableName']))
HDI['Country1'] = HDI['Country1'].str[0]
HDI

,HDI Rank,Country,1990,1991,1992,1993,1994,1995,1996,1997,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,Country1
0,169,Afghanistan,0.302,0.307,0.316,0.312,0.307,0.331,0.335,0.339,...,0.477,0.489,0.496,0.5,0.5,0.502,0.506,0.509,0.511,Afghanistan
1,69,Albania,0.65,0.631,0.615,0.618,0.624,0.637,0.646,0.645,...,0.764,0.775,0.782,0.787,0.788,0.788,0.79,0.792,0.795,Albania
2,91,Algeria,0.572,0.576,0.582,0.586,0.59,0.595,0.602,0.611,...,0.728,0.728,0.729,0.736,0.74,0.743,0.745,0.746,0.748,Algeria
3,36,Andorra,..,..,..,..,..,..,..,..,...,0.836,0.858,0.856,0.863,0.862,0.866,0.863,0.867,0.868,Andorra
4,148,Angola,..,..,..,..,..,..,..,..,...,0.533,0.544,0.555,0.565,0.572,0.578,0.582,0.582,0.581,Angola
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
184,113,Venezuela (Bolivarian Republic of),0.644,0.654,0.66,0.662,0.662,0.666,0.668,0.67,...,0.769,0.772,0.777,0.775,0.769,0.759,0.743,0.733,0.711,NaN
185,117,Viet Nam,0.483,0.493,0.504,0.514,0.525,0.537,0.548,0.547,...,0.671,0.676,0.681,0.683,0.688,0.693,0.696,0.7,0.704,Vietnam
186,179,Yemen,0.401,0.401,0.404,0.406,0.408,0.414,0.421,0.426,...,0.506,0.504,0.509,0.502,0.483,0.474,0.467,0.468,0.47,"Yemen, Rep."
187,146,Zambia,0.421,0.417,0.416,0.419,0.414,0.415,0.416,0.416,...,0.534,0.549,0.557,0.561,0.569,0.571,0.578,0.582,0.584,Zambia
188,150,Zimbabwe,0.478,0.481,0.467,0.463,0.46,0.453,0.453,0.447,...,0.499,0.525,0.537,0.547,0.553,0.558,0.563,0.569,0.571,Zimbabwe

In [5]:
HDI.to_excel(r"HDI_update.xlsx")

In [22]:
def fuzzy_merge(df_1, df_2, key1, key2, threshold=90, limit=1):
    """
    :param df_1: the left table to join
    :param df_2: the right table to join
    :param key1: key column of the left table
    :param key2: key column of the right table
    :param threshold: how close the matches should be to return a match, based on Levenshtein distance
    :param limit: the amount of matches that will get returned, these are sorted high to low
    :return: dataframe with boths keys and matches
    """
    s = df_2[key2].tolist()
    
    m = df_1[key1].apply(lambda x: process.extract(x, s, limit=limit))    
    df_1['matches'] = m
    
    m2 = df_1['matches'].apply(lambda x: ', '.join([i[0] for i in x if i[1] >= threshold]))
    df_1['matches'] = m2
    
    return df_1

In [23]:
HDI_fuzzy = fuzzy_merge(HDI, Countries, 'Country', 'TableName', threshold=80)

In [29]:
HDI_fuzzy.to_excel(r"HDI_fuzzy.xlsx")

In [24]:
HDI_update = pd.merge(HDI_fuzzy,Countries[["TableName","Country Code"]],how='left',left_on='matches',right_on='TableName')

In [25]:
HDI_update.loc[(HDI_update.Country == 'Czechia'),"Country Code"] = 'CZE'
HDI_update.loc[(HDI_update.Country == 'Kyrgyzstan'),"Country Code"] = 'KGZ'
HDI_update.loc[(HDI_update.Country == "Lao People's Democratic Republic"),"Country Code"] = 'LAO'
HDI_update.loc[(HDI_update.Country == '"Palestine'),"Country Code"] = 'PSE'
HDI_update.loc[(HDI_update.Country == 'Slovakia'),"Country Code"] = 'SVK'
HDI_update.loc[(HDI_update.Country == 'Venezuela (Bolivarian Republic of)'),"Country Code"] = 'VEN'

In [9]:
HDI_update.loc[(HDI_update.Country == 'Czechia')]
HDI_update.loc[(HDI_update.Country == 'Venezuela (Bolivarian Republic of)')]

,HDI Rank,Country,1990,1991,1992,1993,1994,1995,1996,1997,...,2013,2014,2015,2016,2017,2018,2019,matches,TableName,Country Code
184,113,Venezuela (Bolivarian Republic of),0.644,0.654,0.66,0.662,0.662,0.666,0.668,0.67,...,0.777,0.775,0.769,0.759,0.743,0.733,0.711,Czech Republic,Czech Republic,VEN

In [61]:
HDI_update1 = HDI_update[['Country Code', '1990', '1991', '1992', '1993', '1994', '1995', '1996', '1997', '1998', '1999', '2000', '2001', '2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013', '2014', '2015', '2016', '2017', '2018', '2019']]
HDI = HDI_update1.melt(id_vars=["Country Code"], 
        var_name="Year", 
        value_name="Value")
HDI.drop(HDI[HDI['Value'] == '..'].index, inplace = True)
HDI['Table'] = 'HDI'
HDI

     Country Code  Year  Value Table
0             AFG  1990  0.302   HDI
1             ALB  1990   0.65   HDI
2             DZA  1990  0.572   HDI
6             ARG  1990  0.718   HDI
7             ARM  1990  0.654   HDI
...           ...   ...    ...   ...
5665          VEN  2019  0.711   HDI
5666          VNM  2019  0.704   HDI
5667          YEM  2019   0.47   HDI
5668          ZMB  2019  0.584   HDI
5669          ZWE  2019  0.571   HDI

[5152 rows x 4 columns]

In [58]:
AdjustedNetIncome1 = AdjustedNetIncome[['Country Code','1960','1961','1962','1963','1964','1965','1966','1967','1968','1969','1970','1971','1972','1973','1974','1975','1976','1977','1978','1979','1980','1981','1982','1983','1984','1985','1986','1987','1988','1989', '1990', '1991', '1992', '1993', '1994', '1995', '1996', '1997', '1998', '1999', '2000', '2001', '2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013', '2014', '2015', '2016', '2017', '2018', '2019','2020','2021']]
AdjustedNetIncome1 = AdjustedNetIncome1.melt(id_vars=["Country Code"], 
        var_name="Year", 
        value_name="Value")
AdjustedNetIncome1['Table'] = 'AdjustedNetIncome'
AdjustedNetIncome2 = AdjustedNetIncome1.dropna()
AdjustedNetIncome2

      Country Code  Year        Value              Table
2662           AFG  1970   148.531898  AdjustedNetIncome
2663           AFW  1970   195.501526  AdjustedNetIncome
2669           ARG  1970   1194.69568  AdjustedNetIncome
2673           AUS  1970  2679.493439  AdjustedNetIncome
2674           AUT  1970  1759.625085  AdjustedNetIncome
...            ...   ...          ...                ...
16219          WLD  2020  8767.399212  AdjustedNetIncome
16220          WSM  2020  3465.005406  AdjustedNetIncome
16223          ZAF  2020  4548.301112  AdjustedNetIncome
16224          ZMB  2020   712.741793  AdjustedNetIncome
16225          ZWE  2020   940.371947  AdjustedNetIncome

[9337 rows x 4 columns]

In [59]:
CountryGdp1 = CountryGdp[['Country Code','1960','1961','1962','1963','1964','1965','1966','1967','1968','1969','1970','1971','1972','1973','1974','1975','1976','1977','1978','1979','1980','1981','1982','1983','1984','1985','1986','1987','1988','1989', '1990', '1991', '1992', '1993', '1994', '1995', '1996', '1997', '1998', '1999', '2000', '2001', '2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013', '2014', '2015', '2016', '2017', '2018', '2019','2020','2021']]
CountryGdp1 = CountryGdp1.melt(id_vars=["Country Code"], 
        var_name="Year", 
        value_name="Value")
CountryGdp1['Table'] = 'CountryGdp'
CountryGdp2 = CountryGdp1.dropna()
CountryGdp2

      Country Code  Year                Value       Table
1              AFE  1960   20082715853.689075  CountryGdp
2              AFG  1960     537777811.111111  CountryGdp
3              AFW  1960   10404280784.153095  CountryGdp
13             AUS  1960   18606786874.230038  CountryGdp
14             AUT  1960     6592693841.18495  CountryGdp
...            ...   ...                  ...         ...
16220          WSM  2020     807100820.648132  CountryGdp
16221          XKX  2020    7716925356.125357  CountryGdp
16223          ZAF  2020  335442101366.417358  CountryGdp
16224          ZMB  2020    18110631358.31139  CountryGdp
16225          ZWE  2020   18051170798.941048  CountryGdp

[12854 rows x 4 columns]

In [57]:
DurSchoolCompulsory1 = DurSchoolCompulsory[['Country Code','1960','1961','1962','1963','1964','1965','1966','1967','1968','1969','1970','1971','1972','1973','1974','1975','1976','1977','1978','1979','1980','1981','1982','1983','1984','1985','1986','1987','1988','1989', '1990', '1991', '1992', '1993', '1994', '1995', '1996', '1997', '1998', '1999', '2000', '2001', '2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013', '2014', '2015', '2016', '2017', '2018', '2019','2020','2021']]
DurSchoolCompulsory1 = DurSchoolCompulsory1.melt(id_vars=["Country Code"], 
        var_name="Year", 
        value_name="Value")
DurSchoolCompulsory1['Table'] = 'DurSchoolCompulsory'
DurSchoolCompulsory2 = DurSchoolCompulsory1.dropna()
DurSchoolCompulsory2

      Country Code  Year Value                Table
10109          AFE  1998   7.0  DurSchoolCompulsory
10110          AFG  1998   6.0  DurSchoolCompulsory
10111          AFW  1998   9.0  DurSchoolCompulsory
10112          AGO  1998   4.0  DurSchoolCompulsory
10113          ALB  1998   8.0  DurSchoolCompulsory
...            ...   ...   ...                  ...
16460          TJK  2021   9.0  DurSchoolCompulsory
16461          TKM  2021  12.0  DurSchoolCompulsory
16477          USA  2021  12.0  DurSchoolCompulsory
16478          UZB  2021  12.0  DurSchoolCompulsory
16481          VGB  2021  12.0  DurSchoolCompulsory

[5360 rows x 4 columns]

In [60]:
LifeExpectancy1 = LifeExpectancy[['Country Code','1960','1961','1962','1963','1964','1965','1966','1967','1968','1969','1970','1971','1972','1973','1974','1975','1976','1977','1978','1979','1980','1981','1982','1983','1984','1985','1986','1987','1988','1989', '1990', '1991', '1992', '1993', '1994', '1995', '1996', '1997', '1998', '1999', '2000', '2001', '2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013', '2014', '2015', '2016', '2017', '2018', '2019','2020','2021']]
LifeExpectancy1 = LifeExpectancy1.melt(id_vars=["Country Code"], 
        var_name="Year", 
        value_name="Value")
LifeExpectancy1['Table'] = 'LifeExpectancy'
LifeExpectancy2 = LifeExpectancy1.dropna()
LifeExpectancy2

      Country Code  Year      Value           Table
0              ABW  1960     65.662  LifeExpectancy
1              AFE  1960  42.716053  LifeExpectancy
2              AFG  1960     32.446  LifeExpectancy
3              AFW  1960   37.20538  LifeExpectancy
4              AGO  1960     37.524  LifeExpectancy
...            ...   ...        ...             ...
16221          XKX  2020  71.087805  LifeExpectancy
16222          YEM  2020     66.181  LifeExpectancy
16223          ZAF  2020     64.379  LifeExpectancy
16224          ZMB  2020     64.194  LifeExpectancy
16225          ZWE  2020     61.738  LifeExpectancy

[14858 rows x 4 columns]

In [62]:
LiteracyRate1 = LiteracyRate[['Country Code','1960','1961','1962','1963','1964','1965','1966','1967','1968','1969','1970','1971','1972','1973','1974','1975','1976','1977','1978','1979','1980','1981','1982','1983','1984','1985','1986','1987','1988','1989', '1990', '1991', '1992', '1993', '1994', '1995', '1996', '1997', '1998', '1999', '2000', '2001', '2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013', '2014', '2015', '2016', '2017', '2018', '2019','2020','2021']]
LiteracyRate1 = LiteracyRate1.melt(id_vars=["Country Code"], 
        var_name="Year", 
        value_name="Value")
LiteracyRate1['Table'] = 'LiteracyRate'
LiteracyRate2 = LiteracyRate1.dropna()
LiteracyRate2

      Country Code  Year      Value         Table
4529           ARB  1977  44.902969  LiteracyRate
4583           EAP  1977   63.98658  LiteracyRate
4584           EAR  1977  49.721581  LiteracyRate
4585           EAS  1977   66.13179  LiteracyRate
4624           IBD  1977  63.442829  LiteracyRate
...            ...   ...        ...           ...
16200          TSA  2020  73.654518  LiteracyRate
16201          TSS  2020  65.858719  LiteracyRate
16209          UMC  2020  95.796822  LiteracyRate
16219          WLD  2020  86.682213  LiteracyRate
16228          AFG  2021  37.266041  LiteracyRate

[2542 rows x 4 columns]

In [63]:
HDI = HDI.reset_index(drop=True)
AdjustedNetIncome2 = AdjustedNetIncome2.reset_index(drop=True)
CountryGdp2 = CountryGdp2.reset_index(drop=True)
DurSchoolCompulsory2 = DurSchoolCompulsory2.reset_index(drop=True)
LifeExpectancy2 = LifeExpectancy2.reset_index(drop=True)
LiteracyRate2 = LiteracyRate2.reset_index(drop=True)
Integrated_National_Indicators = pd.concat([HDI, AdjustedNetIncome2, CountryGdp2, DurSchoolCompulsory2, LifeExpectancy2, LiteracyRate2], axis=0)
Integrated_National_Indicators

     Country Code  Year      Value         Table
0             AFG  1990      0.302           HDI
1             ALB  1990       0.65           HDI
2             DZA  1990      0.572           HDI
3             ARG  1990      0.718           HDI
4             ARM  1990      0.654           HDI
...           ...   ...        ...           ...
2537          TSA  2020  73.654518  LiteracyRate
2538          TSS  2020  65.858719  LiteracyRate
2539          UMC  2020  95.796822  LiteracyRate
2540          WLD  2020  86.682213  LiteracyRate
2541          AFG  2021  37.266041  LiteracyRate

[50103 rows x 4 columns]

In [64]:
Integrated_National_Indicators.to_excel(r"Integrated_National_Indicators.xlsx")